export const monthsByNumber =
    new Map([
            [8, "آبان"],
            [7, "مهر"], [3, "خرداد"],
            [6, "شهریور "], [10, "دی"],
            [2, "اردیبهشت"], [9, "آذر"],
            [12, "اسفند"], [11, "بهمن"],
            [4, "تیر"], [1, "فروردین"],
            [5, "اَمرداد"]
        ]
    );


export const monthsByName = new Map([
    ["فروردین", 1], ["اردیبهشت", 2],
    ["خرداد", 3],
    ["تیر", 4],
    ["اَمرداد", 5],
    ["شهریور", 6],
    ["مهر", 7],
    ["آبان", 8],
    ["آذر", 9],
    ["دی", 10],
    ["بهمن", 11],
    ["اسفند", 12],
]);
